Documents/РеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РеализацияТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
				<xr:Item>Document.РезервыТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Резервы</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПроцентОтПродажиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ИтогиПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.СобранныеСБ</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНаСкладе</xr:Item>
				<xr:Item>AccountingRegister.РегистрУправленческий</xr:Item>
				<xr:Item>AccountingRegister.Хозяйственный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоровыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезервыТоваров</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РезервыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиНаСкладе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНаСкладе</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склады</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/РеализацияТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьЗначениеКонстантыРасчетСтоимости()
	ДаНет = Константы.РасчитатьСтоимостьАвтоматически.Получить();
	Возврат ДаНет;
КонецФункции	
&НаСервереБезКонтекста
Функция ТоварыПриАктивизацииСтрокиНаСервере(СтруктураДанных,Товар)
	Отбор  = Новый Структура("Номенклатура,Склады",Товар,СтруктураДанных.Склады ); 
	НаДату=СтруктураДанных.Дата;
	Если ЗначениеЗаполнено(НаДату) Тогда
		
		//Таблица =РегистрыНакопления.ОстаткиТоваров.Остатки(Дата,Отбор);
		Граница = Новый Граница (НаДату, ВидГраницы.Включая);
		
		Таблица =РегистрыНакопления.ОстаткиНаСкладе.Остатки(Граница,Отбор);
		
	Иначе
	Таблица =РегистрыНакопления.ОстаткиНаСкладе.Остатки(,Отбор);
	
	КонецЕсли; 
	Возврат Таблица.Итог("Количество");
КонецФункции

&НаСервере
Функция ПолучитьЦену(Товар,Дата,Склад)
	Цена = 0;
	Цена = ОбщееНазначение.ПолучитьЦенуТовара(Товар,Дата,Склад.Оптовый);
	//Цена = Товар.Цена;
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЦеныТоваровСрезПоследних.Цена КАК Цена
	//|ИЗ
	//|	РегистрСведений.ЦеныТоваров.СрезПоследних(&НаДату, Товар = &Товар) КАК ЦеныТоваровСрезПоследних";
	//
	//Запрос.УстановитьПараметр("НаДату", Дата);
	//Запрос.УстановитьПараметр("Товар", Товар);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	Цена = ВыборкаДетальныеЗаписи.Цена;	
	//КонецЦикла;
	
	//Отбор = новый структура("Товар",Товар) ;
	//Цена = РегистрыСведений.ЦеныТоваров.ПолучитьПоследнее(Дата,Отбор).Цена;
	Возврат Цена;	

КонецФункции	
&НаКлиенте
Процедура РасчетСумму()
	РасчитатьСтоимость = ПолучитьЗначениеКонстантыРасчетСтоимости();
	Если РасчитатьСтоимость Тогда 
		Элементы.Товары.ТекущиеДанные.Стоимость = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.ЦенаРеализации;
	КонецЕсли;
КонецПроцедуры	
&НаКлиенте
Процедура РасчетСтоимости(Элемент)
	РасчетСумму();	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтоимостьПриИзменении(Элемент)
	СтоимостьСкидка = ОбщееНазначение.РасчитатьСтоимостьСкидку(Элементы.Товары.ТекущиеДанные.Количество,Элементы.Товары.ТекущиеДанные.ЦенаРеалиации);
	Элементы.Товары.ТекущиеДанные.Стоимость = СтоимостьСкидка[0];
	Элементы.Товары.ТекущиеДанные.Скидка = СтоимостьСкидка[1];
	Элементы.Товары.ТекущиеДанные.СтомостьСоСкидкой =СтоимостьСкидка[2];
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	Если Элементы.Товары.ТекущаяСтрока<> Неопределено Тогда
		ТД = Элементы.товары.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТД.Номенклатура) Тогда
			СтруктураДанных=Новый Структура;
			СтруктураДанных.Вставить("Дата",Объект.Дата);
			СтруктураДанных.Вставить("Склады",Объект.Склад);
			Остаток =ТоварыПриАктивизацииСтрокиНаСервере(СтруктураДанных,ТД.Номенклатура);
		Иначе
			Остаток =0;
		КонецЕсли; 
		
	КонецЕсли; 

КонецПроцедуры


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТД = Элементы.Товары.ТекущиеДанные;
	Цена = ПолучитьЦену(ТД.Номенклатура,объект.Дата,Объект.Склад);
	ТД.ЦенаРеализации = Цена;
	
	РасчетСумму();
	Если ЗначениеЗаполнено(ТД.Номенклатура) Тогда
		 СтруктураДанных = Новый Структура;
		 СтруктураДанных.Вставить("Дата",Объект.Дата);
		 СтруктураДанных.Вставить("Склады",Объект.Склад);
		 
		 Остаток = ТоварыПриАктивизацииСтрокиНаСервере(СтруктураДанных,ТД.Номенклатура);
	КонецЕсли;	
КонецПроцедуры
